app/controllers/books_controller.rb

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "aa"], ["body", "aaa"], ["created_at", "2017-12-23 04:57:36.627166"], ["updated_at", "2017-12-23 04:57:36.627166"], ["user_id", 1]]
---
  def create
        @books = Book.all
        @book = Book.new(book_params)
        @book.user_id = current_user.id
        @user = current_user
        if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "w"], ["body", "s"], ["updated_at", "2017-12-23 06:47:43.746620"], ["id", 4]]
---
  def update
        @book = Book.find(params[:id])
        @book.update(book_params)