app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @book = Book.new
    @books = Book.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "aaa"], ["profile_image_id", "52054b340cbef1cedae2dabadd71d3a761fe62a17c6219c0c74e6e06096b"], ["introduction", "\r\n"], ["updated_at", "2017-12-24 07:03:31.212780"], ["id", 1]]
---
	def update
    @user = User.find(params[:id])
    @user.update(user_params)